# Напишите программу, которая
# найдёт произведение пар чисел списка.
# Парой считаем первый и последний элемент, второй и предпоследний и т.д.
# Пример:
# [2, 3, 4, 5, 6] => [12, 15, 16];
# [2, 3, 5, 6] => [12, 15]

from random import randint

my_list = []
n = 5

for i in range(n):
    my_list.append(randint(1, 9))
print(f'Заданный список: \n{my_list}')